
/**
  ******************************************************************************
  * @file    drv_uart2_1.h
  * @author  コア
  * @version V1.0
  * @date    2017.10.2
  * @brief   P02, P03を使用してUART CH1でデータの送受信を行う
  *          受信バッファは2048バイトとする。
  ******************************************************************************
  $Id: drv_uart2_1.h 201 2018-06-15 06:10:56Z shitaoka $
  * @attention
  *
  *****************************************************************************
*/ 

#ifndef _DRV_UART2_1_H_
#define _DRV_UART2_1_H_

/********************************************************************/
/*!
 * \name	i2c1_boot_init
 * \brief	I2C CH0 Driverの変数初期化
 * \param	なし
 * \return  なし
 * \note	i2c1_initを呼ぶ前に１度呼び出すこと。
 */
/********************************************************************/
extern void i2c1_boot_init( void );

/********************************************************************/
/*!
 * \name	drv_uart2_1_init
 * \brief	UART Ch1 の初期化
 * \param	なし
 * \return  0: 正常
 * \note	BAUD RATE  115200
 *          RECV_BUFF  2048
 */
/********************************************************************/
extern int drv_uart2_1_init( void );

/********************************************************************/
/*!
 * \name	drv_uart2_1_stop
 * \brief	UART Ch1 の停止
 * \param	なし
 * \return  0: 正常
 * \note	動作クロックの供給を停止してUARTチャネルを禁止します
 */
/********************************************************************/
extern void drv_uart2_1_stop( void ) ;

/********************************************************************/
/*!
 * \name	drv_uart2_1_start
 * \brief	UART Ch1 の再開
 * \param	なし
 * \return  0: 正常
 * \note	動作クロックを供給してUARTチャネルを許可します。
 */
/********************************************************************/
extern void drv_uart2_1_start( void );

/********************************************************************/
/*!
 * \name	drv_uart2_1_send
 * \brief	データをUART CH1経由で送信します。
 * \param	buff   : 送信データ
 *			length : データ長
 * \return   0: 正常
 *			-1: 異常
 * \note	送信が完了するまで待ちます。
 */
/********************************************************************/
extern int32_t drv_uart2_1_send( uint8_t *buff , int32_t length );


/********************************************************************/
/*!
 * \name	UART2_1_GetChar
 * \brief	UART CH1１文字受信
 * \param	なし
 * \return  -1: 受信データなし
 *          以外: 受信データ
 * \note	
 */
/********************************************************************/
extern int32_t UART2_1_GetChar(void);

/********************************************************************/
/*!
 * \name	UART2_1_IRQHandler
 * \brief	UART CH1 受信割り込み処理
 * \param	
 * \return  
 * \note	受信バッファに受信データを登録する。
 *          受信バッファがFULL時はerrorを+1する。
 */
/********************************************************************/
extern void UART2_1_IRQHandler( void );


#endif // _DRV_UART2_1_H_
