/**
  ******************************************************************************
  * @file    ctrl_W25Q.h
  * @author  コア
  * @version V1.0
  * @date    2018.3.19
  * @brief   このファイルはW25Qを制御するソフトウェアです。
  ******************************************************************************
  * @attention
  *
  *****************************************************************************
*/ 


#ifndef _CTRL_W25Q_H_
#define _CTRL_W25Q_H_


/********************************************************************/
/*!
 * \name	ctrl_W25Q_init
 * \brief	USB初期化処理
 * \param	なし
 * \return  なし
 * \note	起動時に、呼ばれること
 */
/********************************************************************/
extern void ctrl_W25Q_init(void);

/********************************************************************/
/*!
 * \name	ctrl_W25Q_erase_all_req
 * \brief	FLASH 全消去コマンドの発行処理
 * \param	なし
 * \return   0: 成功
 *          -1: 失敗
 * \note	全消去コマンドを発行します
 */
/********************************************************************/
extern int32_t  ctrl_W25Q_erase_all_req( void );

/********************************************************************/
/*!
 * \name	ctrl_W25Q_erase_sector_req
 * \brief	FLASH sector消去コマンドの発行処理
 * \param	addr  : sector消去する先頭アドレス
 * \return   0: 成功
 *          -1: 失敗
 * \note	sector(256バイト)消去コマンドを発行します
 */
/********************************************************************/
extern int32_t  ctrl_W25Q_erase_sector_req( uint32_t addr );

/********************************************************************/
/*!
 * \name	ctrl_W25Q_erase_32k_block_req
 * \brief	FLASH 32kB block消去コマンドの発行処理
 * \param	addr  : block消去する先頭アドレス
 * \return   0: 成功
 *          -1: 失敗
 * \note	block(32kバイト)消去コマンドを発行します
 */
/********************************************************************/
extern int32_t  ctrl_W25Q_erase_32k_block_req( uint32_t addr );

/********************************************************************/
/*!
 * \name	ctrl_W25Q_erase_64k_block_req
 * \brief	FLASH 64kB block消去コマンドの発行処理
 * \param	addr  : block消去する先頭アドレス
 * \return   0: 成功
 *          -1: 失敗
 * \note	block(64kバイト)消去コマンドを発行します
 */
/********************************************************************/
extern int32_t  ctrl_W25Q_erase_64k_block_req( uint32_t addr );

/********************************************************************/
/*!
 * \name	ctrl_W25Q_write_page
 * \brief	FLASH PAGE(512Byte)書き込み処理
 * \param	addr   : flash 書き込みアドレス
 *          data   : flash 書き込みデータ
 *          length : データ長
 * \return  0: 成功  -1:失敗
 * \note	
 */
/********************************************************************/
extern int32_t   ctrl_W25Q_write_page(uint32_t addr , uint8_t *data, int32_t length);

/********************************************************************/
/*!
 * \name	ctrl_W25Q_read
 * \brief	FLASH 読み込み処理
 * \param	addr    :: 読み出しアドレス
 *          data    :: 格納アドレス
 *          nBytes  :: 読み出しサイズ
 * \return   0: 成功
 *          -1: 失敗
 * \note	
 */
/********************************************************************/
extern int32_t ctrl_W25Q_read(uint32_t addr ,  uint8_t *data ,  uint32_t nBytes );

/********************************************************************/
/*!
 * \name	clrl_W25Q_WriteEnable
 * \brief	FLASH 書込み許可コマンド送信処理
 * \param	なし
 * \return   0: 成功
 *          -1: 失敗
 * \note	ERASE, WRITE実行前に呼び出す必要があります。
 */
/********************************************************************/
extern int32_t clrl_W25Q_WriteEnable( void );

/********************************************************************/
/*!
 * \name	ctrl_W25Q_IsBusy
 * \brief	FLASH 書込み等の処理中チェック
 * \param	なし
 * \return  0 : 作業中, -1 : アイドル中
 * \note	ERASE, WRITEの書き込みの終了が確認できます。
 */
/********************************************************************/
extern int32_t ctrl_W25Q_IsBusy( void );

/********************************************************************/
/*!
 * \name	ctrl_SPIA_end
 * \brief	SPIA Ch0 の使用を中止する
 *          CS, SDI, SDO, CLK端子をHi-Z stateとする
 * \param	なし
 * \return  なし
 * \note	必要時に、呼ばれること
 */
/********************************************************************/
extern void ctrl_SPIA_end(void);

/********************************************************************/
/*!
 * \name	ctrl_SPIA_re_start
 * \brief	SPIA Ch0 の使用を再開する
 *          CS, SDI, SDO, CLK端子を再設定する
 * \param	なし
 * \return  なし
 * \note	ctrl_SPIA_endの復活時に、呼ばれること
 */
/********************************************************************/
extern void ctrl_SPIA_re_start(void);

#endif // _CTRL_W25Q_H_
