/**
  ******************************************************************************
  * @file    ctrl_I2C1.h
  * @author  コア
  * @version V1.0
  * @date    2017.10.2
  * @brief   このファイルはI2C CH1を制御するソフトウェアです。
  ******************************************************************************
  $Id: ctrl_GPIO.h 160 2018-05-16 04:14:16Z y-suyama $
  * @attention
  *
  *****************************************************************************
*/ 


#ifndef _CTRL_I2C1_H_
#define _CTRL_I2C1_H_


/********************************************************************/
/*!
 * \name	ctrl_I2C1_init
 * \brief	I2C Ch1 初期化 & 使用開始
 * \param	なし
 * \return  なし
 * \note	起動時に、呼ばれること
 */
/********************************************************************/
extern void ctrl_I2C1_init(void);

/********************************************************************/
/*!
 * \name	ctrl_I2C1_end
 * \brief	I2C Ch1 の使用を中止する
 *          SCL, SDA端子をHi-Z stateとする
 * \param	なし
 * \return  なし
 * \note	必要時に、呼ばれること
 */
/********************************************************************/
extern void ctrl_I2C1_end(void);

/********************************************************************/
/*!
 * \name	ctrl_I2C1_re_start
 * \brief	I2C Ch1 の使用を再開する
 *          SCL, SDA端子を再設定する
 * \param	なし
 * \return  なし
 * \note	ctrl_I2C1_endの復活時に、呼ばれること
 */
/********************************************************************/
extern void ctrl_I2C1_re_start(void);

#endif // _CTRL_I2C1_H_
