/**
  ******************************************************************************
  * @file    ctrl_MPL3115A2.h
  * @author  コア
  * @version V1.0
  * @date    05-August-2016
  * @brief   このファイルはデバイス(MPL3115A2)を制御するソフトウェアです。
  ******************************************************************************
  $Id: ctrl_MPL3115A2.h 182 2018-05-25 04:55:18Z shitaoka $
  * @attention
  *
  *   関数呼出し後、100ms待って次の関数を呼び出してください。
  *   準備中の場合、100ms後に再度呼び出してください。
  *
  *****************************************************************************
*/ 

#ifndef _CTRL_MPL3115A2_H_
#define _CTRL_MPL3115A2_H_

/********************************************************************/
/*!
 * \name	ctrc_MPL3115A2_start
 * \brief	MPL3115A2の開始処理
 * \return   0: 成功
 *          -1:失敗
 * \note	なし
 */
/********************************************************************/
extern int32_t ctrc_MPL3115A2_start(void);

/********************************************************************/
/*!
 * \name	get_temp_press
 * \brief	気温・気圧データを取得する
 * \param	temperature : 気温(-** ～ **[℃])格納エリア
 * 			pressure    : 気圧(******[hPa])格納エリア
 * \return   0: 成功
 *          -1: 失敗
 *           1: 準備中
 * \note	データサンプル間の最小時間 258 msです。
 */
/********************************************************************/
extern int32_t ctrc_MPL3115A2_get_press(int32_t *temperature, int32_t *pressure);

/********************************************************************/
/*!
 * \name	get_altitude
 * \brief	高度データを取得する
 * \param	altitude : 高度(-*** ～ *****[m])格納エリア
 * \return   0: 成功
 *          -1:失敗
 *           1: 準備中
 * \note	データサンプル間の最小時間 258 msです。
 */
/********************************************************************/
extern int32_t ctrc_MPL3115A2_get_altitude(int32_t *altitude);

/********************************************************************/
/*!
 * \name	ctrc_MPL3115A2_set_standby
 * \brief	スタンバイモードに移行する
 * \param	
 * \return   0: 成功
 *          -1:失敗
 * \note	
 */
/********************************************************************/
extern int32_t ctrc_MPL3115A2_set_standby( void );

/********************************************************************/
/*!
 * \name	ctrc_MPL3115A2_set_active
 * \brief	アクティブモードに移行する
 * \param	
 * \return   0: 成功
 *          -1:失敗
 * \note	
 */
/********************************************************************/
extern int32_t ctrc_MPL3115A2_set_active( void );

/********************************************************************/
/*!
 * \name	ctrc_MPL3115A2_offset_press
 * \brief	気圧の補正を行う
 *            範囲は-512 ? +508Pa、4Pa / LSBです
 * \param	offset : 気温のオフセット値(1カウントは4Pa)
 * \return   0: 成功
 *          -1:失敗
 * \note	100Pa = 1hPa
 */
/********************************************************************/
extern int32_t ctrc_MPL3115A2_offset_press( int8_t offset );

/********************************************************************/
/*!
 * \name	ctrc_MPL3115A2_offset_temp
 * \brief	温度の補正を行う
 *            範囲は -8 ? +7.9375℃, 0.0625℃/ LSBです。
 * \param	offset : 気温のオフセット値(1カウントは0.0625℃)
 * \return   0: 成功
 *          -1:失敗
 * \note	
 */
/********************************************************************/
extern int32_t ctrc_MPL3115A2_offset_temp( int8_t offset );

/********************************************************************/
/*!
 * \name	ctrc_MPL3115A2_offset_altitude
 * \brief	高度の補正を行う
 *            範囲は -128?+ 127メートルです。1メートル/ LSBです。
 * \param	offset :高度のオフセット値(1カウントは1メートル)
 * \return   0: 成功
 *          -1:失敗
 * \note	
 */
/********************************************************************/
extern int32_t ctrc_MPL3115A2_offset_altitude( int8_t offset );


#endif // _CTRL_MPL3115A2_H_
