
/**
  ******************************************************************************
  * @file    drv_wdt.h
  * @author  コア
  * @version V1.0
  * @date    2017.10.2
  * @brief   WDT機能を提供する
  ******************************************************************************
  $Id: drv_wdt.h 57 2018-03-30 05:54:51Z shitaoka $
  * @attention
  *
  * 
  *****************************************************************************
*/


#ifndef _DRV_WDT_H_
#define _DRV_WDT_H_

/********************************************************************/
/*!
 * \name	wdt_init
 * \brief	WDT Driverの初期化
 * \param	なし
 * \return   0: 成功
 *          -1: 失敗
 * \note	WDT時間：256Hz * 1024 = 4秒
 *			変更する場合seWDT2_SetCMPを使用
 */
/********************************************************************/
extern int32_t wdt_init( void ) ;

/********************************************************************/
/*!
 * \name	wdt_start
 * \brief	WDT Driverの開始
 * \param	なし
 * \return  なし
 * \note	
 */
/********************************************************************/
extern void wdt_start( void );

/********************************************************************/
/*!
 * \name	wdt_start
 * \brief	WDT Driverの停止
 * \param	なし
 * \return  なし
 * \note	
 */
/********************************************************************/
extern void wdt_stop( void );

/********************************************************************/
/*!
 * \name	wdt_resetCounter
 * \brief	WDT Driverのカウンタリセット
 * \param	なし
 * \return  なし
 * \note	
 */
/********************************************************************/
extern void wdt_resetCounter( void );

/********************************************************************/
/*!
 * \name	wdt_reset
 * \brief	WDT Driverを使用してリセット
 * \param	なし
 * \return  なし
 * \note	
 */
/********************************************************************/
extern void wdt_reset( void );


#endif // _DRV_WDT_H_

