/**
  ******************************************************************************
  * @file    drv_usb.h
  * @author  コア
  * @version V1.0
  * @date    2017.10.2
  * @brief   シリアルUSBドライバ提供関数
  ******************************************************************************
  $Id: drv_usb.h 57 2018-03-30 05:54:51Z shitaoka $
  * @attention
  *
  ******************************************************************************
  */

#ifndef _DRV_USB_H_
#define _DRV_USB_H_

/********************************************************************/
/*!
 * \name	serial_usb_init
 * \brief	シリアルUSB Driverの初期化
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	
 */
/********************************************************************/
extern int32_t serial_usb_init( void );

/********************************************************************/
/*!
 * \name	serial_usb_get_size_sbuff
 * \brief	シリアルUSB送信バッファの空きサイズを取得する
 * \param	なし
 * \return  空きサイズ
 * \note	
 */
/********************************************************************/
extern int32_t serial_usb_get_size_sbuff( void );

/********************************************************************/
/*!
 * \name	serial_usb_send
 * \brief	シリアルUSB送信
 * \param	buff   : 送信データ
 *			length : 送信データ長
 * \return   0: 成功
 *          -1: 失敗
 * \note	
 */
/********************************************************************/
extern int32_t serial_usb_send( const uint8_t *buff, int32_t length );

/********************************************************************/
/*!
 * \name	serial_usb_get_size_recv
 * \brief	シリアルUSB受信したデータ数を取得する
 * \param	なし
 * \return  受信したデータ数
 * \note	
 */
/********************************************************************/
extern int32_t serial_usb_get_size_recv( void );

/********************************************************************/
/*!
 * \name	drv_usb_GetChar
 * \brief	シリアルUSB１文字受信
 * \param	なし
 * \return  -1: 受信データなし
 *          以外: 受信データ
 * \note	
 */
/********************************************************************/
extern int32_t drv_usb_GetChar(void);

/********************************************************************/
/*!
 * \name	drv_usb_chk_config
 * \brief	USBデバイスの設定を確認する
 * \param	なし
 * \return  0 : 設定
 *          -1: 未設定
 * \note	設定後はUSBの使用が可能となります
 */
/********************************************************************/
extern int32_t drv_usb_chk_config( void );

/********************************************************************/
/*!
 * \name	ctrl_USB_chk_config
 * \brief	USBデバイスの設定を確認する
 * \param	なし
 * \return  0 : 設定
 *          -1: 未設定
 * \note	設定後はUSBの使用が可能となります
 */
/********************************************************************/
extern int32_t ctrl_USB_chk_config( void );

/********************************************************************/
/*!
 * \name	drv_usb_exec_reset
 * \brief	USBデバイスのリセットを実施する
 * \param	なし
 * \return  なし
 * \note	
 */
/********************************************************************/
extern void drv_usb_exec_reset( void );

#endif // _DRV_USB_H_
