
/**
  ******************************************************************************
  * @file    drv_uart2_0.h
  * @author  コア
  * @version V1.0
  * @date    2017.10.2
  * @brief   P16, P17を使用してUART CH0でデータの送受信を行う
  *          受信バッファは5200バイトとする。
  ******************************************************************************
  $Id: drv_uart2_0.h 201 2018-06-15 06:10:56Z shitaoka $
  * @attention
  *
  *****************************************************************************
*/ 

#ifndef _DRV_UART2_0_H_
#define _DRV_UART2_0_H_

/********************************************************************/
/*!
 * \name	i2c0_boot_init
 * \brief	I2C CH0 Driverの変数初期化
 * \param	なし
 * \return  なし
 * \note	i2c0_initを呼ぶ前に１度呼び出すこと。
 */
/********************************************************************/
extern void i2c0_boot_init( void );


/********************************************************************/
/*!
 * \name	drv_uart2_0_init
 * \brief	UART Ch0 の初期化
 * \param	なし
 * \return  0: 正常
 * \note	BAUD RATE  115200
 *          RECV_BUFF  5200
 */
/********************************************************************/
extern int drv_uart2_0_init( void );

/********************************************************************/
/*!
 * \name	drv_uart2_0_stop
 * \brief	UART Ch0 の停止
 * \param	なし
 * \return  0: 正常
 * \note	動作クロックの供給を停止してUARTチャネルを禁止します
 */
/********************************************************************/
extern void drv_uart2_0_stop( void );

/********************************************************************/
/*!
 * \name	drv_uart2_0_start
 * \brief	UART Ch0 の再開
 * \param	なし
 * \return  0: 正常
 * \note	動作クロックを供給してUARTチャネルを許可します。
 */
/********************************************************************/
extern void drv_uart2_0_start( void );

/********************************************************************/
/*!
 * \name	drv_uart2_0_send
 * \brief	データをUART CH0経由で送信します。
 * \param	buff   : 送信データ
 *			length : データ長
 * \return   0: 正常
 *			-1: 異常
 * \note	送信が完了するまで待ちます。
 */
/********************************************************************/
extern int drv_uart2_0_send( uint8_t *buff , int length );

/********************************************************************/
/*!
 * \name	UART2_0_GetChar
 * \brief	UART CH0１文字受信
 * \param	なし
 * \return  -1: 受信データなし
 *          以外: 受信データ
 * \note	
 */
/********************************************************************/
extern int32_t UART2_0_GetChar(void);

/********************************************************************/
/*!
 * \name	UART2_0_CheckErrorCount
 * \brief	UART CH0受信の取りこぼし回数取得
 * \param	なし
 * \return  取りこぼし発生回数
 * \note	
 */
/********************************************************************/
extern uint32_t UART2_0_CheckErrorCount(void);

/********************************************************************/
/*!
 * \name	UART2_0_IRQHandler
 * \brief	UART CH0 受信割り込み処理
 * \param	
 * \return  
 * \note	受信バッファに受信データを登録する。
 *          受信バッファがFULL時はerrorを+1する。
 */
/********************************************************************/
extern void UART2_0_IRQHandler( void );

#endif // _DRV_UART2_0_H_

