
/**
  ******************************************************************************
  * @file    man_version.h
  * @author  コア
  * @version V1.0
  * @date    2017.10.2
  * @brief   versionを管理する
  ******************************************************************************
  $Id: man_version.h 57 2018-03-30 05:54:51Z shitaoka $
  * @attention
  *
  *****************************************************************************
*/


#ifndef _MAN_VERSION_H_
#define _MAN_VERSION_H_

/********************************************************************/
/*!
 * \name	man_version_get_data
 * \brief	version情報を取得する処理
 * \param	なし
 * \return  なし
 * \note	必要時に呼ばれること
 */
/********************************************************************/
extern void man_version_get_data( int8_t *data );


#endif		// _MAN_VERSION_H_
