
/**
  ******************************************************************************
  * @file    man_memory.h
  * @author  コア
  * @version V1.0
  * @date    2017.10.2
  * @brief   メモリを管理する
  ******************************************************************************
  $Id: man_memory.h 57 2018-03-30 05:54:51Z shitaoka $
  * @attention
  *
  *****************************************************************************
*/

#ifndef _MAN_MEMORY_H_
#define _MAN_MEMORY_H_


#define	MAN_MEMORY_ALLOC_MAX		2048


/********************************************************************/
/*!
 * \name	man_memory_alloc
 * \brief	メモリ確保処理
 * \param	なし
 * \return  メモリ」先頭アドレス
 * \note	一次バッファでのみ使用してください
 *          確保できるサイズはMAN_MEMORY_ALLOC_MAXです
 */
/********************************************************************/
extern uint8_t *man_memory_alloc( void );


#endif		// _MAN_MEMORY_H_

