
/**
  ******************************************************************************
  * @file    man_press.h
  * @author  コア
  * @version V1.0
  * @date    2017.10.2
  * @brief   高度・気温・気圧データを管理する
  ******************************************************************************
  $Id: man_press.h 182 2018-05-25 04:55:18Z shitaoka $
  * @attention
  *
  *****************************************************************************
*/


#ifndef _MAN_PRESS_H_
#define _MAN_PRESS_H_


#define	MAN_PRESS_OFFSET_PRESS_MIN			-5			// 気圧の補正最小値 -5hPa
#define	MAN_PRESS_OFFSET_PRESS_MAX			5			// 気圧の補正最大値  5hPa
#define	MAN_PRESS_OFFSET_TEMP_MIN			-8			// 気温の補正最小値 -8℃
#define	MAN_PRESS_OFFSET_TEMP_MAX			8			// 気温の補正最大値  8℃
#define	MAN_PRESS_OFFSET_ALTITUDE_MIN		-128		// 高度の補正最小値 -128m
#define	MAN_PRESS_OFFSET_ALTITUDE_MAX		127			// 高度の補正最大値  127m


/********************************************************************/
/*!
 * \name	man_press_init
 * \brief	高度・気温・気圧データ管理の初期化処理
 * \param	なし
 * \return   0: 成功
 *          -1:失敗
 * \note	起動時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_press_init(void);


/********************************************************************/
/*!
 * \name	man_press_main
 * \brief	高度・気温・気圧データ管理のmain処理
 * \param	なし
 * \return  なし
 * \note	500ms毎に呼ばれること
 */
/********************************************************************/
extern void man_press_main(void);

/********************************************************************/
/*!
 * \name	man_press_get_data
 * \brief	保持している高度・気温・気圧データの取得
 * \param	temperature : 気温(-** ～ **[℃])
 *          pressure    : 気圧(******[hPa])
 *          altitude    : 高度(-*** ～ *****[m])
 * \return   0: 正常
 *          -1: 異常
 * \note	必要時に呼ばれること
 */
/********************************************************************/
extern int32_t man_press_get_data(int32_t *temperature, int32_t *pressure, int32_t *altitude);

/********************************************************************/
/*!
 * \name	man_press_get_new_data
 * \brief	取得できた高度・気温・気圧データの取得
 * \param	temperature : 気温(-** ～ **[℃])
 *          pressure    : 気圧(******[hPa])
 *          altitude    : 高度(-*** ～ *****[m])
 * \return   0: 取得
 *          -1: 未取得
 * \note	必要時に呼ばれること
 */
/********************************************************************/
extern int32_t man_press_get_new_data(int32_t *temperature, int32_t *pressure, int32_t *altitude);

/********************************************************************/
/*!
 * \name	man_press_standby
 * \brief	高度・気温・気圧データ管理のスタンバイモード処理
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	アクティブ -> スタンバイ時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_press_standby(void);

/********************************************************************/
/*!
 * \name	man_press_standby
 * \brief	高度・気温・気圧データ管理のアクティブモード処理
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	スタンバイ -> アクティブ時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_press_active(void);

/********************************************************************/
/*!
 * \name	man_press_off
 * \brief	高度・気温・気圧データ管理のOFFモード処理
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	アクティブ -> OFF時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_press_off(void);

/********************************************************************/
/*!
 * \name	man_press_on
 * \brief	高度・気温・気圧データ管理のONモード処理
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	OFF -> アクティブ時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_press_on(void);

/********************************************************************/
/*!
 * \name	man_press_set_offset_press
 * \brief	気圧の補正を行う
 *             範囲は-5 ? +5hPa、1hPa / LSBです
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	気圧の補正を行う時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_press_set_offset_press( int32_t offset );


/********************************************************************/
/*!
 * \name	man_press_set_offset_temp
 * \brief	温度の補正を行う
 *             範囲は-8 ? +8℃, 1℃/ LSBです。
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	温度の補正を行う時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_press_set_offset_temp( int32_t offset );

/********************************************************************/
/*!
 * \name	man_press_set_offset_altitude
 * \brief	高度の補正を行う
 *             範囲は -128?+ 127メートルです。1メートル/ LSBです。
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	高度の補正を行う時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_press_set_offset_altitude( int32_t offset );


#endif // _MAN_PRESS_H_

