
/**
  ******************************************************************************
  * @file    man_battery.h
  * @author  コア
  * @version V1.0
  * @date    2017.11.14
  * @brief   バッテリー電圧、残量データを管理する
  ******************************************************************************
  $Id: man_battery.h 57 2018-03-30 05:54:51Z shitaoka $
  * @attention
  *
  *****************************************************************************
*/


#ifndef _MAN_BATTERY_H_
#define _MAN_BATTERY_H_

/********************************************************************/
/*!
 * \name	man_battery_init
 * \brief	電圧・バッテリー残量の初期化処理
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	起動時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_battery_init(void);

/********************************************************************/
/*!
 * \name	man_battery_500ms_main
 * \brief	電圧・バッテリー残量データ管理のmain処理
 * \param	なし
 * \return  なし
 * \note	500ms毎に呼ばれること
 */
/********************************************************************/
extern void man_battery_500ms_main(void);

/********************************************************************/
/*!
 * \name	man_battery_get_data
 * \brief	保持している電圧・バッテリー残量データの取得
 * \param	voltage    : 電圧(0～6000 mV)
 *          remaining  : バッテリー残量(0～100%)
 * \return   0: 正常
 *          -1: 異常
 * \note	必要時に呼ばれること
 */
/********************************************************************/
extern int32_t man_battery_get_data(int32_t *voltage, int32_t *remaining);

/********************************************************************/
/*!
 * \name	man_battery_active
 * \brief	電圧・バッテリー残量データ管理のアクティブモード処理
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	スタンバイ -> アクティブ時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_battery_active(void);

/********************************************************************/
/*!
 * \name	man_battery_standby
 * \brief	電圧・バッテリー残量データ管理のスタンバイモード処理
 * \param	なし
 * \return   0: 正常
 *          -1: 異常
 * \note	アクティブ -> スタンバイ時に、呼ばれること
 */
/********************************************************************/
extern int32_t man_battery_standby(void);

#endif	// _MAN_BATTERY_H_
