
/**
  ******************************************************************************
  * @file    drv_t16_3.h
  * @author  コア
  * @version V1.1
  * @date    05-August-2016
  * @brief   T16 CH3ドライバ提供関数
  *          T16 CH3を使用して1msタイマを動作させる
  *          10ms, 100ms, 500ms, 1000ms毎の時間経過を提供する。
  ******************************************************************************
  $Id: drv_t16_3.h 57 2018-03-30 05:54:51Z shitaoka $
  * @attention
  *
  *    1. t16_3_init()                  : 初期化
  *    2. t16_3_start()                 : 開始
  *    3. time1 = t16_3_get_counter()   : 
  *    4. time2 = t16_3_get_counter()   : 
  *    5. time2 - time1 が経過時間      : time1からtime2までの経過時間
  *    6. t16_3_stop()                  : 終了
  *****************************************************************************
*/

#ifndef _DRV_T16_CH3_H_
#define _DRV_T16_CH3_H_


#define T16_3_MAX_COUNT		0x3fffffff


// hdl関数(void)
typedef void (*func_drv_t16_3)( void );

/********************************************************************/
/*!
 * \name	t16_3_init
 * \brief	T16 Ch3 Timer(1ms)の初期化
 * \param	なし
 * \return  なし
 * \note	1msタイマー
 */
/********************************************************************/
extern void t16_3_init( void );

/********************************************************************/
/*!
 * \name	t16_3_start
 * \brief	T16 Ch3 Timer 開始
 * \param	なし
 * \return  なし
 * \note	1msタイマー
 */
/********************************************************************/
extern void t16_3_start( void );

/********************************************************************/
/*!
 * \name	t16_3_start
 * \brief	T16 Ch3 Timer 停止
 * \param	なし
 * \return  なし
 * \note	1msタイマー
 */
/********************************************************************/
extern void t16_3_stop( void );

/********************************************************************/
/*!
 * \name	t16_3_get_counter
 * \brief	T16 Ch3 Timer のカウンタ値を取得
 * \param	なし
 * \return  1msフリーカウンタ値
 * \note	
 */
/********************************************************************/
extern uint32_t t16_3_get_counter(void);

/********************************************************************/
/*!
 * \name	t16_3_init_check
 * \brief	T16 Ch3 経過判定 初期化
 * \param	なし
 * \return  なし
 * \note	
 */
/********************************************************************/
extern void t16_3_init_check(void);

/********************************************************************/
/*!
 * \name	t16_3_check_10ms
 * \brief	T16 Ch3 10m経過判定
 * \param	なし
 * \return  0: 時間未経過
 *          1: 時間経過
 * \note	
 */
/********************************************************************/
extern uint32_t t16_3_check_10ms(void);

/********************************************************************/
/*!
 * \name	t16_3_check_100ms
 * \brief	T16 Ch3 100m経過判定
 * \param	なし
 * \return  0: 時間未経過
 *          1: 時間経過
 * \note	
 */
/********************************************************************/
extern uint32_t t16_3_check_100ms(void);

/********************************************************************/
/*!
 * \name	t16_3_check_500ms
 * \brief	T16 Ch3 500m経過判定
 * \param	なし
 * \return  0: 時間未経過
 *          1: 時間経過
 * \note	
 */
/********************************************************************/
extern uint32_t t16_3_check_500ms(void);

/********************************************************************/
/*!
 * \name	t16_3_check_1000ms
 * \brief	T16 Ch3 1000m経過判定
 * \param	なし
 * \return  0: 時間未経過
 *          1: 時間経過
 * \note	
 */
/********************************************************************/
extern uint32_t t16_3_check_1000ms(void);


/********************************************************************/
/*!
 * \name	t16_3_set_500ms_hdl
 * \brief	500ms毎に呼ばれる割り込み関数を登録する処理
 * \param	hdl_500ms  : 500ms毎に呼ばれる割り込み関数
 * \return  なし
 * \note	処理時間を短くすること
 */
/********************************************************************/
void t16_3_set_500ms_hdl( func_drv_t16_3 hdl_500ms );

/********************************************************************/
/*!
 * \name	PRG_T16_3_IRQHandler
 * \brief	T16 Ch3 割り込み処理
 * \param	なし
 * \return  なし
 * \note	
 */
/********************************************************************/
extern void PRG_T16_3_IRQHandler( void );

#endif // _DRV_T16_CH3_H_
