/**
  ******************************************************************************
  * @file    ctrl_BQ28Z610.h
  * @author  コア
  * @version V1.0
  * @date    13-Novenber-2016
  * @brief   このファイルはI2C CH1を使用してデバイス(BQ28Z610)を制御するソフトウェアです。
  ******************************************************************************
  $Id: ctrl_BQ28Z610.h 182 2018-05-25 04:55:18Z shitaoka $
  * @attention
  *
  *****************************************************************************
*/ 


#ifndef _CTRL_BQ28Z610_H_
#define _CTRL_BQ28Z610_H_

/********************************************************************/
/*!
 * \name	ctrl_BQ28Z610_start
 * \brief	BQ28Z610の開始処理
 * \return   0: 成功
 *          -1:失敗
 * \note	なし
 */
/********************************************************************/
extern int32_t ctrl_BQ28Z610_start(void);

/********************************************************************/
/*!
 * \name	ctcr_BQ28Z610_get_voltage
 * \brief	電圧を取得する
 * \param	voltage : 電圧情報を格納する
 * \return   0: 成功
 *          -1: 失敗
 * \note	
 */
/********************************************************************/
extern int32_t ctrl_BQ28Z610_get_voltage(int32_t *voltage);

/********************************************************************/
/*!
 * \name	ctrl_BQ28Z610_get_remaining
 * \brief	バッテリー残量を取得する
 * \param	remaining : バッテリー残量を格納する
 * \return   0: 成功
 *          -1: 失敗
 * \note	
 */
/********************************************************************/ 
extern int32_t ctrl_BQ28Z610_get_remaining(int32_t  *remaining);

/********************************************************************/
/*!
 * \name	ctrl_BQ28Z610_get_current
 * \brief	バッテリのCharge/Dischargeの電流値を取得する
 * \param	current : 電流情報を格納する
 * \return   0: 成功
 *          -1: 失敗
 * \note	
 */
/********************************************************************/
extern int32_t ctrl_BQ28Z610_get_current(int16_t *current);


#endif //_CTRL_BQ28Z610_H_